<?php

return [
    1 => '主题锁帖',
    2 => '主题解锁',
    3 => '主题转私密',
    4 => '主题转公开',
    15 => '主题改边限',
    16 => '主题改非边限',
    21 => '主题禁止回复',
    22 => '主题允许回复',
    40 => '主题上浮',
    41 => '主题下沉',
    42 => '主题推荐',
    43 => '主题推荐撤销',
    44 => '主题精华',
    45 => '主题精华撤销',
    9 => '主题转移板块',
    5 => '主题删除',
    6 => '主题恢复',

    10 => '回帖修改马甲',
    37 => '回帖转边缘',//?
    38 => '回帖转非边缘',//?
    11 => '回帖折叠',
    12 => '回帖解折',
    32 => '回帖折+禁（回帖折叠，发帖人禁言+一天）',//?车轱辘,版务区水贴，作者楼里水贴
    30 => '回帖折+禁+清（回帖折叠，发帖人禁言+1天，积分等级清零）',//一直一直车轱辘、多次在版务区不看首楼跟帖，多次在作者问题楼/他人讨论楼里问等级签到问题等情况
    34 => '回帖折+清+封（回帖折叠，等级清零，发言人禁止登陆1天）',//？特么特别驴叫不改的违禁
    35 => '回帖删+清+封（回帖删除，等级清零，发言人禁止登陆7天）',//？普通辱骂
    36 => '回帖删+封（回帖删除，等级清零，发言人永久禁止登陆）',//？特别厉害的辱骂
    7 => '回帖删除',

    13 => '禁言用户',
    14 => '解禁用户',
    18 => '禁止登陆',
    19 => '允许登陆',
    20 => '等级清零',
    50 => '分值管理', //增加减少盐粒，咸鱼，火腿，等级

    61 => '动态转私密',
    62 => '动态转公开',
    63 => '私+禁（动态转私密，发帖人禁言+一天）',//边限动态
    64 => '私+禁+清（动态转私密，发帖人禁言+1天，积分等级清零）',//多次比较严重的边限/违规动态
    65 => '删+清+封（动态删除，积分等级清零，发言人禁止登陆1天）',//违反商业性规定/恋童
    66 => '删+封（动态删除，发言人永久禁止登陆）',//恶意广告
    17 => '动态删除',

    31 => '点评套餐：禁言、折叠、积分清零',// 已失效
    8 => '删除点评',
];
