<?php

return [
    'not_in_public' => "|♂|骚浪贱|骚浪||NP|np|Np|nP|高H|高h|强制爱|处男|处女|恋童癖|恋童|3P|骑乘|脐橙|play|普雷|纯肉|滥交|NTR|性癖|扶她|扶他|自慰|强上|啪啪啪|调♂教|调教|鸡巴|J8|撸|双性|产子|淫荡|荡妇|爱液|按摩棒|拔出来|爆草|暴干|暴奸|暴乳|爆乳|暴淫|被操|被插|被干|逼奸|插暴|插爆|操逼|肏|潮吹|抽插|抽送|后穴|淫液|操烂|吞精|春药|发浪|发骚|粉穴|菊穴|干死你|肛交|肛门|龟头|AV|GV|巨屌|口爆|口暴|口活|口交|狂操|浪叫|凌辱|乱交|乱伦|裸陪|轮暴|轮奸|合奸|迷奸|强暴|全裸|人妻|人兽|肉棒|肉具|骚逼|骚水|乳交|乳沟|射颜|颜射|熟女|调教|小穴|小逼|性交|性奴|性虐|胸推|穴口|阳具|体位|舔脚|文爱|文做|要射了|淫贱|淫媚|淫糜|援交|欲火|QJ|qj|lj|LJ|lt|LT|幼幼|TJ|BDSM|艹哭|草哭|操爆|操射|操翻|草射|yj|jy|双龙|双龙入洞|骚货|淫乱|开苞|双穴|嫩穴|插穴|骚穴|子宫|宫口|产乳|喷奶|射精|精液|射niao|射尿|灌肠|rbq|肉便器|肉bq|肉BQ|肉bQ|肉Bq|Y蒂|阴蒂|H图|发情|潮喷|潮吹|失禁|大奶|R18|r18|纯肉|纯H|奶子|小狼狗|腰好肾好|公狗腰|内射|大奶|虐乳|肛塞|骚话|后入|SP|sp|贞操带|喝奶|欲求不满|玩弄|NC-17|NC17|黑车|肉香|香艳|存车|凭票上车|开车|小车车|车|肉|炖肉|燉肉|纯写肉|脑洞肉|含肉|肉文|肉肉|很荤|痴汉|抖m|抖s|抖M|抖S|性转车|约炮|YP|炮友|啪|pa|性福|PWP|群交|群P|群p|艹|",

    'not_in_title' => "|【|】|X|╳|<|>|〈|〉|\[|\]|\/|\||\\\\|（|）|\(|\)|——|\+|\*|\%|《|》|\?\?|!!|？？|！！|abo|ABO|『|』|〔|〕|alpha|Alpha|omega|Omega|beta|Beta|虫族|",
];
