<?php

return [
    //对于受限制的tag，用户最多选择x个
    'sum_limit_count' => 5,

    //所有大类列表
    'types' => [
        '大类'  ,
        '篇幅'  ,
        '性向'  ,
        '进度'  ,
        '床戏性质'  ,
        '同人原著'  ,
        '同人CP'  ,
        '同人聚类'  ,
        '版权'  ,
        '结局'  ,
        '故事气氛'  ,
        '整体时代'  ,
        '故事观感'  ,
        '强弱关系'  ,
        '伦理关系'  ,
        'CP关系'  ,
        '视角关系'  ,
        '人称'  ,
        '床戏性质'  ,
        '人物性格'  ,
        '执业范围'  ,
        '特殊元素'  ,
        '具体情节'  ,
        '世界设定'  ,
        '生物设定'  ,
        '风俗环境'  ,
        '性癖'  ,
        '编推'  , //专题推荐，当前编推
        '管理'  , //（共享的）高亮，精华，置顶，
        '阅读进度'  , //（共享的），想读，在读，已读，弃文，养肥
        '阅读反馈'  , //（共享的），推荐，多次阅读，
    ],
    'limits' => [
        'only_one' => [
            '篇幅'  ,
            '性向'  ,
            '进度'  ,
            '同人原著'  ,
            '同人CP'  ,
            '结局'  ,
            '床戏性质'  ,
        ],
        'sum_limit' => [
            '大类'  ,
            '故事气氛'  ,
            '整体时代'  ,
            '故事观感'  ,
            '强弱关系'  ,
            '伦理关系'  ,
            'CP关系'  ,
            '同人聚类'  ,
            '视角关系'  ,
            '人称'  ,
            '人物性格'  ,
            '执业范围'  ,
            '特殊元素'  ,
            '具体情节'  ,
            '世界设定'  ,
            '生物设定'  ,
            '风俗环境'  ,
            '性癖'  ,
        ],
        'admin_only' => [//用户没有选择权利
            '编推'  , //
            '管理'  , //
        ],
    ],

    'book_info' =>[
        'originality_info' => [
            0 => '同人',
            1 => '原创',
        ],
        'channel_info' => [
            1 => '原创',
            2 => '同人',
        ],
        'book_length_info' => [
            '1' => '短篇',
            '2' => '中篇',
            '3' => '长篇',
            '4' => '大纲',
        ],
        'book_status_info' => [
            '1' => '连载',
            '2' => '完结',
            '3' => '暂停',
        ],
        'sexual_orientation_info' => [ //0:未知，1:BL，2:GL，3:BG，4:GB，5:混合性向，6:无CP，7:其他性向
            '0' => '性向未知',
            '1' => 'BL',
            '2' => 'GL',
            '3' => 'BG',
            '4' => 'GB',
            '5' => '混合性向',
            '6' => '无CP',
            '7' => '其他性向',
        ],
        'rating_info' => [ //1:非边缘, 2:边缘
            '1' => '非边限',
            '2' => '边限',
        ],
        'orderby_info' => [ //1:按最新章节, 2:按最新回贴时间, 3:积分排序, 4.字数均衡积分
            '1' => '最新章节',
            '2' => '最新回复',
            '3' => '总积分',
            '4' => '均字数积分',
        ],
    ],
    'custom_tag_types' => [ //不包括“同人原著”，“同人CP”,不包括篇幅tag
        '大类',
        '故事气氛',
        '整体时代',
        '故事观感',
        '强弱关系',
        '伦理关系',
        'CP关系',
        '视角关系',
        '人称',
        '人物性格',
        '执业范围',
        '特殊元素',
        '具体情节',
        '世界设定',
        '生物设定',
        '风俗环境',
        '床戏性质',
        '性癖',
        '版权',
        '结局',
        '同人聚类',
    ],
];
